Infineon/psoc6hal/include/cyhal_adc.h
/***************************************************************************//**
* \file cyhal_adc.h
*
* \brief
* Provides a high level interface for interacting with the Cypress Analog to
* Digital Converter. This interface abstracts out the chip specific details.
* If any chip specific functionality is necessary, or performance is critical
* the low level functions can be used directly.
*
********************************************************************************
* \copyright
* Copyright 2018-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hal_adc ADC (Analog to Digital Converter)
* \ingroup group_hal
* \{
* High level interface for interacting with the analog to digital converter (ADC).
*
* \section cyhal_adc_features Features
* Each ADC instance supports one or more selectable channels, each
* of which can perform conversions on a different pin.
* See the device datasheet for details about which pins support ADC conversion.
*
* Both single-ended and differential channels are supported. The values returned
* by the read API are relative to the ADC's voltage range, which is device specific.
* See the BSP documentation for details.
*
* \section cyhal_adc_quickstart Quickstart
* Call \ref cyhal_adc_init to initialize an ADC instance by providing the ADC
* object (<b>obj</b>), input pin (<b>pin</b>) and clock (<b>clk</b>).<br> The input
* pin argument is just to signify which ADC instance to initialize. It does not
* actually reserve the pin or create an ADC channel for it. The clock parameter can
* be left NULL to use an available clock resource with a default frequency.<br>
* Use \ref cyhal_adc_channel_init_diff to initialize one or more channels associated
* with that instance.<br>
* Use \ref cyhal_adc_read for reading the results.<br>
* See \ref subsection_adc_snippet_1.
*
* \note \ref cyhal_adc_read_u16 always returns a 16 bit value in the range
* 0x0000-0xFFFF. If the underlying hardware does not support 16 bit resolution the
* value is scaled linearly to cover the full 16 bits.
*
* \section subsection_adc_snippets Code snippets
* \note Error checking is omitted for clarity
* \subsection subsection_adc_snippet_1 Snippet 1: Simple ADC initialization and
* reading conversion result
* The following snippet initializes an ADC and one channel.
* One ADC conversion result is returned corresponding to the input at the specified
* pin.
* \snippet adc.c snippet_cyhal_adc_simple_init
*
* \subsection subsection_adc_snippet_2 Snippet 2: Multi-channel ADC initialization and reading conversion result
* The following snippet initializes an ADC with one single-ended channel and one differential channel
* \snippet adc.c snippet_cyhal_adc_multi_init
*
* \subsection subsection_adc_snippet_3 Snippet 3: Asynchronously read multiple channels
*  The following snippet illustrates how to asynchronously read multiple scans of multiple channels.
* \snippet adc.c snippet_cyhal_adc_async_read
*
* \subsection subsection_adc_snippet_4 Snippet 4: Continuous scanning
*  This snippet shows how to run the ADC in continuous mode and process results as each scan completes.
* \snippet adc.c snippet_cyhal_adc_continuous_read
*/

#pragma once

#include <stdint.h>
#include <stdbool.h>
#include "cy_result.h"
#include "cyhal_hw_types.h"
#include "cyhal_gpio.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_hal_results
 *  \{ *//**
 *  \{ @name ADC Results
 */

/** Bad argument */
#define CYHAL_ADC_RSLT_BAD_ARGUMENT                     \
    (CYHAL_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CYHAL_RSLT_MODULE_ADC, 0))
/** Failed to initialize ADC clock */
#define CYHAL_ADC_RSLT_FAILED_CLOCK                     \
    (CYHAL_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CYHAL_RSLT_MODULE_ADC, 1))
/** Failed to initialize ADC */
#define CYHAL_ADC_RSLT_FAILED_INIT                      \
    (CYHAL_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CYHAL_RSLT_MODULE_ADC, 2))
/** No channels available */
#define CYHAL_ADC_RSLT_NO_CHANNELS                      \
    (CYHAL_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CYHAL_RSLT_MODULE_ADC, 3))

/**
 * \} \}
 */

/** Number of bits populated with meaningful data by each ADC sample */
#define CYHAL_ADC_BITS 16
/** Maximum value that the ADC can return */
#define CYHAL_ADC_MAX_VALUE ((1 << CYHAL_ADC_BITS) - 1)

/** Possible selections for ADC reference */
typedef enum
{
    CYHAL_ADC_REF_INTERNAL,     //!< Internal reference. See the BSP documentation for the value of this reference. (Default)
    CYHAL_ADC_REF_EXTERNAL,     //!< Reference from external pin.
    CYHAL_ADC_REF_VDDA,         //!< Reference from VDDA (analog supply)
    CYHAL_ADC_REF_VDDA_DIV_2,   //!< Reference from VDDA (analog supply) divided by 2
} cyhal_adc_vref_t;

/** Vminus selection for single-ended channels */
typedef enum
{
    CYHAL_ADC_VNEG_VSSA, //!< Connect vminus to ground.
    CYHAL_ADC_VNEG_VREF, //!< Connect vminus to the selected vref (see @ref cyhal_adc_vref_t)
} cyhal_adc_vneg_t;

/** ADC events */
typedef enum
{
    CYHAL_ADC_EOS = 1u,                  //!< End of scan: a scan of all channels has completed. Only applicable when continuously scanning
    CYHAL_ADC_ASYNC_READ_COMPLETE = 2u,  //!< An asynchronous read operation has completed.
} cyhal_adc_event_t;

/** Perform standard averaging. Divide the accumulated value by the number of samples.
  * @note This is not supported in combination with @ref CYHAL_ADC_AVG_MODE_ACCUMULATE */
#define CYHAL_ADC_AVG_MODE_AVERAGE    (1u << 0)
/** Accumulate samples as in @ref CYHAL_ADC_AVG_MODE_AVERAGE, but do not divide by the number of samples */
#define CYHAL_ADC_AVG_MODE_ACCUMULATE (1u << 1)
/** Average mode flag position indices shifted by greater than this are implementation specific. The value
  * of this macro is subject to change between HAL versions. */
#define CYHAL_ADC_AVG_MODE_MAX_SHIFT (1u)

/** Selects the default connection for the inverting input to achieve a single-ended channel. This connection
  * is controlled by the `vneg` member of @ref cyhal_adc_config_t.
  */
#define CYHAL_ADC_VNEG CYHAL_NC_PIN_VALUE

/** ADC Configuration */
typedef struct
{
    /** Whether the ADC samples continuously (true) or only on demand (false).
      *
      * When configured to true, the ADC will immediately begin scanning all configured channels.
      * When configured to false, the ADC will stop continuous scanning at the completion of the current scan
      */
    bool                continuous_scanning;
    /** ADC resolution. See the implementation specific documentation for supported values */
    uint8_t             resolution;
    /** The number of samples that should be averaged together to obtain a result. A value of 1 disables averaging. */
    uint16_t            average_count;
    /** Flags to control the behavior of the averaging functionality when @ref average_count is greater than 1.
      * This field contains zero or more flags that are OR'd together. All implementations define
      * @ref CYHAL_ADC_AVG_MODE_AVERAGE and @ref CYHAL_ADC_AVG_MODE_ACCUMULATE (though some may not support both modes).
      * Some implementations may define other flags to control additional aspects of the averaging functionality; see
      * the implementation-specific documentation for details.
      */
    uint32_t            average_mode_flags;
    /** The external voltage reference value, in millivolts.
      * If vref is set to @ref CYHAL_ADC_REF_EXTERNAL, this must be nonzero.
      * If vref is set to anything other than @ref CYHAL_ADC_REF_EXTERNAL, this must be zero.
      */
    uint32_t            ext_vref_mv;
    /** Vminus selection for single-ended channels */
    cyhal_adc_vneg_t    vneg;
    /** ADC voltage reference */
    cyhal_adc_vref_t    vref;
    /** The GPIO that should be used for the external reference. If @ref CYHAL_ADC_REF_EXTERNAL
      * is selected and the current target uses a GPIO for ADC ext_vref (see the BSP documentation),
      * this must not be @ref NC. If the current target uses a dedicated pin (not a GPIO) for ADC ext_vref,
      * or if any other reference is selected, this must be @ref NC.
      */
    cyhal_gpio_t        ext_vref;
    /** Whether an external bypass capacitor should be used. Depending on the platform this may be required
      * to reduce noise at sufficiently high sample rates. See the implementation specific documentation
      * for details.
      */
    bool                is_bypassed;
    /** The GPIO pin that should be used for the bypass capacitor. If `is_bypassed` is true and the current target
      * uses a GPIO for the bypass capacitor connection, this must not be @ref NC. Otherwise, this must be @ref NC.
      * Depending on the device, this may be the same GPIO as `ext_vref`. See the BSP documentation for details.
      */
    cyhal_gpio_t        bypass_pin;
} cyhal_adc_config_t;

